// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "キャンセル";
"GOBACK_BUTTON"		= "戻る";
"DIAGNOSE_BUTTON"	= "診断";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "コンピュータを構成しています...";
"MESSAGE_PREP_CONNECTION"	= "接続の準備をしています...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "予期しないエラー";
"MESSAGE_FATAL_ERROR_TITLE"		= "申し訳ありません、予期しないエラーが発生しました。";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "エラー";
"ERROR_MESSAGE_GENERIC_TITLE"			= "申し訳ありません...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "申し訳ありません";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "警告";
"ERROR_MESSAGE_VALIDATION_WARNING" = "続けますか？";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "必要な情報がまだ全部入力されていません。";
"ERROR_MESSAGE_VALIDATION_0001" = "矢印のアイコンが表示されている項目を確認し、情報を入力してください。";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "入力した情報は短すぎます。";
"ERROR_MESSAGE_VALIDATION_0002" = "選択されている項目を確認し、正しく入力してください。";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "入力した情報が正しくありません。";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "入力したユーザ名は正しくありません。";
"ERROR_MESSAGE_VALIDATION_0004" = "選択されている項目を確認し、お使いの NetInfo ネットワークでの正しいユーザ名を入力してください。";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "入力したパスワードは正しくありません。";
"ERROR_MESSAGE_VALIDATION_0005" = "選択されている項目を確認し、正しいパスワード入力してください。";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "入力したユーザ名は使用できません。";
"ERROR_MESSAGE_VALIDATION_0006" = "選択されている項目を確認し、別のユーザ名を入力してください。";
"ERROR_MESSAGE_VALIDATION_0007" = "そのユーザ名はすでに存在します。別のユーザ名を入力してください。";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "入力した IP アドレスは空です。";
"ERROR_MESSAGE_VALIDATION_0010" = "入力した IP アドレスに使用できない文字が含まれています。";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "アドレスは 4 つに区切られていなければなりません。"; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "選択されている項目を確認し、正しいアドレスを入力してください。よく分からない場合は、ネットワーク管理者にお問い合わせください。";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "アドレスは 4 つに区切られていなければなりません。"; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "選択されている項目を確認し、正しいアドレスを入力してください。よく分からない場合は、ネットワーク管理者にお問い合わせください。";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "各区切りは 1 〜 3 桁でなければなりません。"; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "選択されている項目を確認し、正しいアドレスを入力してください。よく分からない場合は、ネットワーク管理者にお問い合わせください。";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "入力したアドレスは認められていません。";
"ERROR_MESSAGE_VALIDATION_0014" = "選択されている項目を確認し、正しいアドレスを入力してください。よく分からない場合は、ネットワーク管理者にお問い合わせください。";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "入力したサブネットマスクは正しくありません。";
"ERROR_MESSAGE_VALIDATION_0015" = "選択されている項目を確認し、正しいサブネットマスクを入力してください。よく分からない場合は、ネットワーク管理者にお問い合わせください。";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "入力した名前は、お使いの NetInfo ネットワーク内に存在します。この名前で NetInfo ネットワークにログインすることはできません。";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "同じ値を指定することはできません。";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "入力したパスワードは正しくありません。";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "入力したクレジット番号は使用できません。";
"ERROR_MESSAGE_VALIDATION_0019" = "選択されている項目を確認し、正しいクレジットカード番号を入力してください。";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "アカウント名を数字で始めることはできません。";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "入力したメールアドレスは使えないかもしれません。";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP アドレスとルーターアドレスが入力したサブネットマスクと矛盾しています。次の項目を確認し、正しい値を入力してください：\n     IP アドレス\n     サブネットマスク\n     ルーターアドレス\nよく分からない場合は、ネットワーク管理者にお問い合わせください。";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "入力したユーザ名は使用できません。";
"ERROR_MESSAGE_VALIDATION_0023" = "選択されている項目を確認し、別の名前を入力してください。";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "重複しています。";
"ERROR_MESSAGE_VALIDATION_0024" = "選択されている項目を確認し、他と重複しない値を入力してください。";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "モデムは発信音を検出できません。";
"MESSAGE_NO_DIAL_TONE"					= "モデムが接続されていることを確認し、“OK”ボタンをクリックしてください。または、“キャンセル”ボタンをクリックして前に戻り、“発信音を無視”チェックボックスをチェックしてください。";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "終了";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "パスワードが一致しません。";
"ERROR_PASSWORD_DO_NOT_MATCH" = "矢印のアイコンのついた項目を確認し、どちらの項目にも同じパスワードを入力してください。";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "ネットワーク環境の名前を入力してください。";
"ERROR_MUST_ENTER_LOCATION_NAME" = "構成情報を保存するための新しいネットワーク環境を作成しています。ここでネットワーク環境の名前を入力してください。";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "別のネットワーク環境名を入力してください。";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "入力したネットワーク環境名はすでに存在しています。別の名前を入力してください。";


"MESSAGE_TASK_FORMAT" = "“%2$@ 経由の %1$@ 接続”"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "ワイヤレス";
"CONNECTION_Modem" = "モデム";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "ケーブルモデム";
"CONNECTION_Lan" = "ローカル・エリア・ネットワーク";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "クライアント ID を使用した DHCP：";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "静的 IP";

"MESSAGE_TITLE_CONFIGURE" = "構成しています...";
"MESSAGE_FAILED_CONFIGURE" = "構成に失敗しました。";
"MESSAGE_DONE_CONFIGURE" = "構成が完了しました。";
"MESSAGE_CHECKING_CONNECTION" = "ネットワーク接続を確認しています...";
"MESSAGE_CONNECTED" = "ネットワーク接続が確立されました。";
"MESSAGE_NOT_CONNECTED" = "ネットワーク接続を確立できませんでした。";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "コンピュータをインターネットに接続できませんでした。“OK”をクリックして前に戻り、ネットワーク設定を変更してから、もう一度やり直してください。";

"DEFAULT_LOCATION_NAME" = "ネットワーク環境（%@）";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";